package com.constant;

/**
 * Created by Q on 2016-05-23.
 */
public class Constant {
    //购物清单详细介绍
    public static String[] str = {
            "冰箱里可以备点添加了玉米粉、豆粉、燕麦粉等杂粮豆类的主食。 " +
                    "全麦主食含有丰富的膳食纤维和B族维生素，对瘦身纤体、降低血脂都有帮助。" +
                    "买回家的主食可以放冰箱里冷冻起来，吃的时候用微波炉解冻加热就可以了。",

            "乳制品营养丰富。建议家里一定要备上乳制品。" +
                    "牛奶可以直接饮用或者搭配咖啡或红茶，原味酸奶可以拌沙拉，还可以加入各种水果调味。" +
                    "建议购买片状奶酪，早上夹馒头或面包，都非常便捷。",

            "杏仁、开心果、核桃、松子等坚果,它们富含维生素E和健康脂肪酸，只要控制食用量，对健康是非常有益的" +
                    "坚果可以当零食，也可以用来拌凉菜，比如桃仁苦菊、老醋花生等。" +
                    "坚果很容易酸败变质，一定要放入冰箱冷藏储存。",

            " 鸡翅、鸭腿都很容易烹调，也非常容易做。" +
                    "鸡翅可以做成红烧鸡翅、黄焖鸡翅、烤鸡翅等，鸭腿能烧也能炖汤。准备点肉馅也是不错的办法。" +
                    "肉馅绝对是厨房里的百变能手，不仅可以包包子、饺子，还可以做丸子、炸酱、肉饼。此外，榄菜肉末四季豆、肉末烧茄子、" +
                    "麻婆豆腐、雪菜肉末炒毛豆都是能用肉馅做出的下饭菜。" +
                    "在保存方面，大家可以把肉馅分份装入保鲜袋，然后压扁封口冷冻，这样的“肉馅饼”非常便于解冻。",

            "蔬菜是健康一餐中必不可少的。冰箱里推荐放一些速冻蔬菜，比如速冻青豆、玉米粒、胡萝卜粒等。" +
                    "新鲜的圆白菜、大白菜等也比较好储存，冰箱保鲜室里可以放一些。" +
                    "蘑菇含有丰富氨基酸，味道鲜美 。将洗净沥干的蘑菇放在牛皮纸袋中，扎好口，放冰箱里可以保存一周。",

            "鱼肉营养丰富，脂肪含量低。可以在超市买几包真空冷冻的速冻鱼肉片，放在冰箱冷冻室里。" +
                    "这种鱼片是做水煮鱼、炒鱼片的好材料。除了速冻鱼肉，速冻虾仁也可以买一些，做菜百搭且方便。",

            "鸡蛋表面天然覆盖着一层抑菌物质，但超市成盒包装鸡蛋已经经过清洗和消毒，“保护膜”已被除去，因此最好放冰箱。"
    };
    //照片名数组
    public static String[] photos = new String[]{"苹果(apple)", "香蕉（banana）", "鸡肉(chicken)", "鱼(fish)","牛奶(milk)",
            "核桃(nut)", "蔬菜（Cabbage）","胡萝卜（Carrot）","花生（peanut）","西红柿（Tomato）","大蒜（Garlic）","玉米（Corn）",
            "绿豆（Green_Bean）","辣椒（Pepper）"};
    public static String[] namePhoto = new String[]{"apple.png", "banana.png", "chicken.png", "fish.png","milk.png",
            "nut.png", "Cabbage.png","Carrot.png","peanut.png","Tomato.png","Garlic.png","Corn.png",
            "Green_Bean.png","Pepper.png"};
    //购物清单对照表
    public static String[] str_list = {"鸡肉","鱼肉","鸭肉","香蕉","苹果","玉米粉","豆粉","牛奶","核桃","开心果","花生","坚果","大白菜","胡萝卜",
            "蘑菇","鸡蛋"};
}
